/**
 * Copyright 2018 Salvatore Romeo
 * 
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 *     http://www.apache.org/licenses/LICENSE-2.0
 *     
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *  
 */

package qa.qcri.iyas.data.reader;

import org.apache.uima.resource.ResourceProcessException;

public class VolatileDataReader extends DataReader {

	private boolean first = true;
	
	@Override
	public boolean hasNext() {
		return first;
	}

	@Override
	public String next() throws ResourceProcessException {
		first = false;
		return "<root>"+
				"	<instance_b>"+
				"		<user_question id=\"Q12\" lang=\"ar\" numberOfCandidates=\"5\">"+
				"			<subject></subject>"+
				"			<body>قبل عام اخذت حبوب منع الحمل لمدة ستة اشهر من اجل تنظيم الدورة. بعد اربعة اشهر فقط اصبحت الدورة عندي منتظمة حدث عندي حمل الذي انتهى بالاجهاض الطبيعي في الاسابيع الاولى. الان الفترات بين الدورات قصيرة جدا انا محبطة للغاية وانا لا افهم ما السبب في ذالك. ما الذي يمكنني عمله لتنظيم الدورة وكيف اعرف متى تحدث الاباضة (ووفقا لاخر دورة; فان الاباضة حدثت قبل 14 يوما من تلقي الدورة حيث كان دم الحيض لا يزال ينزل هل يمكن حدوث شيء كهذا )</body>"+
				"		</user_question>"+
//				"		<related_question id=\"Q12_R1\" lang=\"ar\" index=\"325\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>عندي تكيس في المبايض واعطتني الدكتوره دواء ديان 35 لتنظيم الدوره لمده 3 شهور استخدمت شهر والشهر الثاني لم تنزل الدوره سوى نقاط بسيطه هل يحصل حمل مع استخدام الدواء واريد حل لمشكلتي وشكرا</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R2\" lang=\"ar\" index=\"326\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>عمري 26 سنة و مقبلة على الزواج بعد 4 اشهر اعاني من عدم انتظام في مدة الدورة الشهرية طول الدورة الشهرية منذ جويلية 2012 حتى نوفمبر 2013 (30 33 31 32 30 28 28 28 32 29 33 29 32 31 30 32 يوم).هل يؤثر هذا على الحمل مستقبلا هل يمكن تنظيمها دون ادوية.شكرا</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R3\" lang=\"ar\" index=\"327\" totalNumberExamples=\"7384\" relevance=\"Relevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال كل عام وأنتم بخير وتقبل الله منا ومنكم صالح الأعمال.. تأتي لزوجتي الدورة الشهرية في تواريخ غير ثابتة كانت تأتيها في نهاية كل شهر 30-31 وبعض الشهور 15-16 من كل شهر وتستمر لمدة 3-5 أيام فهل تعتبر منتظمة وأيام الإخصاب من 12-14 يوماً من بداية الدورة هل بداية الجماع بعد الطهر له ضرر وإمكانية حدوث الحمل. وجزاكم الله خيراً.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R4\" lang=\"ar\" index=\"328\" totalNumberExamples=\"7384\" relevance=\"Relevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم متزوجة منذ ثلاثة أشهر وعادتي عملت على تنظيمها لمدة سنة بواسطة حبوب منع الحمل إذ أنها بعد الزواج بدأت لا تنتظم وكانت قد أخبرتني الدكتورة أنني أشكو من عدم الإباضة وقد وصفت لي كلوميد لكنني لم أتناوله فهل هذا يعنني أنني لن أحمل ولكم الشكر</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R5\" lang=\"ar\" index=\"329\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>الدورة الشهرية تاتي كل 15 يوم و ليس 21 يوم هل الوضع طبيعي</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R6\" lang=\"ar\" index=\"330\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السلام عليكم أنا عمري ١٨ أخذ حبوب منع حمل بهدف تنظيم الدورة الشهرية المفروض على ثلاث كورسات خذت الكورس الأول والثاني كاملين الثالث نسيت ابدا فيه المشكلة يتني دورتين بينهم اسبوع واحد: هل هالشي طبيعي</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R7\" lang=\"ar\" index=\"331\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>علی أي أساس استطيع تحديد ما اذا كانت دورتي الشهريه منتظمة او لا ( يرجی توضيح ذلك بمثال لحسابها ) وما هي أنسب فترة لحدوث الحمل</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R8\" lang=\"ar\" index=\"332\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم ورحمة الله وبركاته عمري 20 عاماً ومتزوجة من سنة ونصف زوجي مهندس بترول يعمل في الصحراء بحكم المهنة ونظام إجازاته غير منتظم ممكن يأتي إجازة لأسبوع كل شهرين أو شهرين ونصف حسب الظروف ومرات يأتي فجأة وأريد تأجيل الحمل لسنة لظروف خاصة -والحمد لله- زوجي وافق ما أفضل دواء لمنع حمل بحثت في النت ووجدت أن حبوب منع الحمل يجب أن آخذها بعد الدورة بيومين أو ثلاثة وطبعاً هذا لا ينفع معي لأني لا أعرف متى يأتي زوجي فهل هناك نوع معين من الحبوب ممكن آخذها يوم الجماع أو قبل الجماع بيوم زوجي لا يحب العازل الذكري وأنا لا أستريح في العازل النسائي لأنه يرفع درجة الحرارة ويتعبني.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R9\" lang=\"ar\" index=\"333\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>مرحبا انا عمري ٢٤ غير متزوجه واعاني من انقطاع الطمث فقط بالعلاج تاتي و مجرد اقطع العلاج تتوقف بعد الفحوصات لدي هرمون fsh و LH منخفضين و تنارلت بروجيلتون ل 3 سنين و لاتزال حالتي كما هي ماهو تشخيصي وهل لها علاج نهائي وهل تؤثر على الانجاب في المستقبل</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R10\" lang=\"ar\" index=\"334\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكمهل استعمال دواء Diana لتركيز الهرمونات والشعر الزائد يؤثر على الحمل وفترة استعماله أكثر من سنة.وشكراً.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R11\" lang=\"ar\" index=\"335\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم. مشكلتي تكمن في تقارب للدورة الشهرية حدث ذلك أول مرة في شهر رمضان بحيث حضت مرتين في الشهر بفاصل 15 يوما بين الدورتين; بعد ذلك جاءت منتظمة إلا أن الحالة تكررت في شهر ذي الحجة فالمرجو أن تشرحوا لي أسباب ذلك وهل للحالة النفسية أثر على ذلك جزاكم الله خير الجزاء. والسلام عليكم.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R12\" lang=\"ar\" index=\"336\" totalNumberExamples=\"7384\" relevance=\"Relevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم ورحمة الله وبركاته أنا متزوجة وعمري35 سنة أريد أن أسأل عن يوم الإباضة عندي: في البداية كانت دورتي منتظمة تنزل يوم 18 من كل شهر لمدة أربعة شهور وبعدها أصبحت تتأخر ونزلت يوم 24 وفي الشهر الذي بعده نزلت في 27 ولا أدري متى موعد الإباضة عندي. أنا عندي أربع بنات وأرجو من الله القدير أن يرزقني بولد ذكر ومن أجل ذلك أسأل عن يوم الإباضة وهل هناك جهازٌ يباع في الصيدليات يوضح يوم الإباضة وإذا كان فما هو اسمه وشكرًا.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R13\" lang=\"ar\" index=\"337\" totalNumberExamples=\"7384\" relevance=\"Relevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم ورحمة الله وبركاته أنا امرأة متزوجة منذ سنتين ونصف وقدحملت بعد زواجي بثلاثة أشهر واستمر الحمل ثلاثة أشهر وحصل بعدها إجهاض وإلى الآن لم يحدث حمل جديد أجريت كافة التحاليل اللازمة وعندي ضعف في الإباضة أعطتني الدكتورة (كلوميد) ولم يحدث أيضا حمل علما أنني عندما حدث الإجهاض أخذت بعدها حبوب منع الحمل لمدة شهرين فهل هي السبب أفيدوني جزاكم الله خيرا</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R14\" lang=\"ar\" index=\"338\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>عضو : السلام عليكم هل حبوب الدوفاتسون التي تاخد من ثالث يوم الدوره لمده 21يوم لتنظيم الدوره تمنع الحمل</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R15\" lang=\"ar\" index=\"339\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال أريد معرفة أيام التبويض لدي حيث كان نزول الدورة عندي كالتالي:(28 4 1429) (27 5 1429) (25 6 1429). مع العلم أنني أستخدم حبوب منع الحمل.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R16\" lang=\"ar\" index=\"340\" totalNumberExamples=\"7384\" relevance=\"Relevant\">"+
//				"			<subject></subject>"+
//				"			<body>دواء Climenهو لمنع الحمل وهل هو لتنظيم الدوره وماهي طريقة إستعماله علما بأني غير متزوجه والدوره عندي غير منتظمه.ارجو الرد</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R17\" lang=\"ar\" index=\"341\" totalNumberExamples=\"7384\" relevance=\"Relevant\">"+
//				"			<subject></subject>"+
//				"			<body>عضو : السلام عليكم مشكلتي هي تأخر الحمل مر على زواجي 6 أشهر و لم يحدث حمل ذهبت إلى طبيبة نساء و قالت أني أعاني من وجود كيستات صغيرة في البويضات و هي ما يجعل دورتي غير منتظمة و بالتالي لا يحدث تبويض و وصفت لي دواء إسمه &quot;duphaston&quot; لمدة 3 أشهر و قالت أنه يمكن حدوث حمل خلال 3 أشهر و إن لم يحدث حمل سوف تخضعني إلى علاج اخر أريد أن أعرف هل يوجد علاج طبيعي لتنظيم الدورة الشهرية و تحسين عملية الإباضة</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R18\" lang=\"ar\" index=\"342\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال الوقت الذي يكون فيه المبيض عند المرأة جاهزاً للحمل بعد الدورة مباشرة وفي نهاية الشهر.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R19\" lang=\"ar\" index=\"343\" totalNumberExamples=\"7384\" relevance=\"Relevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم ورحم الله وبركاته. أنا متزوجة منذ أربع سنوات عمري 27 سنة رزقني الله بطفل بعد إجهاضين -والحمد لله- بعد الولادة بثلاثة أشهر أخذت حبوب منع الحمل لمدة سنة وأربعة أشهر وتوقفت عن أخذها منذ ستة أشهر ولم يحدث حمل إلى الآن ذهبت للطبيبة وعملت لي تحليل دم للإباضة والنتيجة كانت جيدة -والحمد لله- التبويض ممتاز وعملت لي تحليل حمل أيضاً مع تحليل الإباضة وكانت النتيجة سلبية سؤالي هو: ما سبب تأخر الحمل إلى الآن وما الممكن عمله لزيادة فرصة حدوث الحمل علماً بأن الدورة لدي ليست منتظمة أحياناً 26 يوماً وأحياناً 30 وأحياناً أكثر. عفواً على الإطالة ولكم جزيل الشكر.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R20\" lang=\"ar\" index=\"344\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>هل يمكن حدوث الحمل قبل الدورةبيومين وهذه مواعيد الدورة فهي تقريبا منتظمة 21 10 2014....20 11 2014....17 12 2014</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R21\" lang=\"ar\" index=\"345\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال أنا سيدة متزوجة وعمري 36 سنة; أتناول حبوب المانع منذ مدة طويلة; في الستة أشهر الأخيرة لاحظت بعد انتهاء الدورة بخمس أيام نزول دم أحمر أو بني مخلوط; يستمر لمدة ثلاث أو أربعة أيام; يصحبه ألم بسيط أسفل البطن. هل هذا أمر طبيعي وشكرا.</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R22\" lang=\"ar\" index=\"346\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم ورحمة الله وبركاته.عمري 32 سنة متزوجة منذ سنتين بعد ثمانية أشهر من الزواج حملت خارج الرحم عملت عملية قيصرية استكشاف بعد أشهر من العملية حملت وأجهضت الجنين في شهرين ونصف عملت تحاليل شاملة للدم وموجات صوتية لمعرفة الأسباب فطلعت كلها نظيفة وعملت قبل أسبوعين موجات لمعرفة التبويض فطلع التبويض سليماً.أريد معرفة ما هي أسباب تأخير الحمل من آخر إجهاض قبل تسعة أشهر هل هنالك أسباب أخرى</body>"+
//				"		</related_question>"+
//				"		<related_question id=\"Q12_R23\" lang=\"ar\" index=\"347\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
//				"			<subject></subject>"+
//				"			<body>السؤال السلام عليكم. أنجبت طفلتي منذ ثلاثة شهور وثلاثة أسابيع ونزلت الدورة للمرة الأولى بعد الولادة بعد أربعين يوما واستمرت 13 يوما وفي الشهر الذي بعدها عندما نزلت استمرت 7 أيام وفي الشهر الثالث استمرت لأكثر من 18 يوماً ولا زالت. لا أدري ما سبب عدم انتظامها مع العلم أني أرضع ابنتي طبيعيا بالإضافة إلى الصناعي وأستعمل حبوب منع الحمل (سيري زيت) فما هو علاج عدم انتظامها وهل أوقف الحبوب أو أستعمل طريقة للتنظيم أخرى مع العلم أن هذه طفلتي الأولى وأنا أستخدم الحبوب من ثاني أيام دورتي الأولى ودورتي قبل الحمل كانت منتظمة وتستمر من 6 -7 أيام فقط. أرجو الرد مع الشكر الجزيل.</body>"+
//				"		</related_question>"+
				"		<related_question id=\"Q12_R24\" lang=\"ar\" index=\"348\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
				"			<subject></subject>"+
				"			<body>السؤال السلام عليكم ورحمة الله وبركاته أنا عروسة وبعد 3 شهور من الزواج حصل حمل مع أن تبوضي كان ضعيفاً كان (.96) ومع ذلك حصل حمل بعد ذلك عملت مجهوداً فحصل لي إجهاض منظر وقبل نهاية الشهر الثاني حصل إجهاض كامل. الدكتورة قالت لي إن الإجهاض كان بسبب أن التبويض كان ضعيفاً ونتيجة لذلك تكون البويضة ضعيفة وتنتهي بإجهاض وقال�� لي إن أول دورة بعد الإجهاض أخذ منشط. أنا خائفة آخذه يعمل لي كيساً على المبيض وخائفة من أن عدم أخذه يحصل به تأخر في الحمل أو أحمل ويحصل إجهاض ثاني. ماذا أعمل مع العلم أن دورتي كانت قبل الزواج غير منتظمة وأظن يوجد تكيس مبيض.</body>"+
				"		</related_question>"+
				"		<related_question id=\"Q12_R25\" lang=\"ar\" index=\"349\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
				"			<subject></subject>"+
				"			<body>انا فتاه دورتي الشهريه غير منتظمه وكنت اعزي ذلك الى الضغط النفسي ولكن بدا شعري بالتساقط وبكميات كبيره اضافه الى غزاره الشعر في الجسم وخفه الشعر في المقدمه وطلع معي البرولاكتين عالي مع قله في fsh.lh وحاليا نزل الى الطبيعي لكن الاعراض مستمره</body>"+
				"		</related_question>"+
				"		<related_question id=\"Q12_R26\" lang=\"ar\" index=\"350\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
				"			<subject></subject>"+
				"			<body>كانت دورتى منتظمة و فى اخر شهرين لم تنتظم و آخر شهر تأخرت 7 ايام و استمرت 8 ايام فبدأت باستخدام حبوب منع الحمل جنيرا لتنظيمها هل ما فعلته صحيح</body>"+
				"		</related_question>"+
				"		<related_question id=\"Q12_R27\" lang=\"ar\" index=\"351\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
				"			<subject></subject>"+
				"			<body>انا وضعت طفلى من عام ولم تنزل الدوره من بعد الولاده حتى ااخر اكتوبر 2014 وتم جماع خلال هذه الفتره ثم نزلت الدوره الشهريه خمسة ايام ولم يتم جماع من بعد نزول الدورة حتى الان ثم ذهبت للدكتوره وقالت لى انى حامل فى 11 اسبوع كيف حدث ذللك وشكرا</body>"+
				"		</related_question>"+
				"		<related_question id=\"Q12_R28\" lang=\"ar\" index=\"352\" totalNumberExamples=\"7384\" relevance=\"Irrelevant\">"+
				"			<subject></subject>"+
				"			<body>السؤال السلام عليكم.. أنا فتاة غير متزوجة أعاني من تكيس المبايض أخذت علاجا لتنظيم الدورة لمدة 6 أشهر بعد ذلك انتظمت الدورة لمدة خمسة أشهر وانقطعت لمدة تزيد عن ثلاثة أشهر وعندما نزلت الدورة كانت على شكل نقاط في اليوم الأول حيث نزلت نقطة دم واحدة في الليل ومن ثم توقفت إلى اليوم التالي ثم نزل دم قليل في الليل والصباح ومن ثم توقف واليوم الذي بعده نزلت إفرازات بنية وكأنها قليل من الدم مع إفرازات قليلة جدا واليوم الذي بعده نزلت إفرازات بنية أكثر واليوم الذي يليه نزل دم قليل واليوم الذي بعده بدأت تنزل الدورة طبيعية وأصبح مجموع الأيام 12 يوما فماذا علي أن أفعل فأنا لا أريد ? ?لذهاب إلى الطبيب ولقد تعبت من أخذ الدواء وأريد علاجا طبيعيا بالأعشاب. وهل التكيس هو كسل في البويضة أم المبيض وهل يحصل تبويض عند نزول الدورة أم تنزل بدون تبويض</body>"+
				"		</related_question>"+
				"	</instance_b>"+
				"</root>";
	}
	
}
